customizations/tools.org
* Dired
#+begin_src emacs-lisp
;; Directory operations
(use-package dired
  :ensure nil
  :bind (:map dired-mode-map
         ("C-c C-p" . wdired-change-to-wdired-mode))
  :config
  ;; Guess a default target directory
  (setq dired-dwim-target t)

  ;; Always delete and copy recursively
  (setq dired-recursive-deletes 'always
        dired-recursive-copies 'always)

  ;; Show directory first
  (setq dired-listing-switches "-alh --group-directories-first")

  (when *IS-MAC*
    (if (executable-find "gls")
        (progn
          ;; Use GNU ls as `gls' from `coreutils' if available.
          (setq insert-directory-program "gls")
          ;; Using `insert-directory-program'
          (setq ls-lisp-use-insert-directory-program t))
      (progn
        ;; Suppress the warning: `ls does not support --dired'.
        (setq dired-use-ls-dired nil)
        (setq dired-listing-switches "-alh"))))

  ;; Quick sort dired buffers via hydra
  (use-package dired-quick-sort
    :bind (:map dired-mode-map
           ("S" . hydra-dired-quick-sort/body)))

  ;; Show git info in dired
  (use-package dired-git-info
    :bind (:map dired-mode-map
           (")" . dired-git-info-mode)))

  ;; Allow rsync from dired buffers
  (use-package dired-rsync
    :bind (:map dired-mode-map
           ("C-c C-r" . dired-rsync)))

  ;; Colorful dired
  (use-package diredfl
    :hook (dired-mode . diredfl-mode))

  ;; Shows icons
  (use-package nerd-icons-dired
    :diminish
    :custom-face
    (nerd-icons-dired-dir-face ((t (:inherit nerd-icons-dsilver :foreground unspecified))))
    :hook (dired-mode . nerd-icons-dired-mode)
    :config
    ;; WORKAROUND: display transparent background of icons
    ;; @see https://github.com/rainstormstudio/nerd-icons-dired/issues/1#issuecomment-2628680359
    (defun my-nerd-icons-dired--add-overlay (pos string)
      "Add overlay to display STRING at POS."
      (let ((ov (make-overlay (1- pos) pos)))
        (overlay-put ov 'nerd-icons-dired-overlay t)
        (overlay-put ov 'after-string
                     (propertize "_" 'display string))))
    (advice-add #'nerd-icons-dired--add-overlay :override #'my-nerd-icons-dired--add-overlay))

  ;; Extra Dired functionality
  (use-package dired-aux :ensure nil)
  (use-package dired-x
    :ensure nil
    :demand t
    :config
    (let ((cmd (cond (*IS-MAC* "open")
                     (*IS-LINUX* "xdg-open")
                     (t ""))))
      (setq dired-guess-shell-alist-user
            `(("\\.pdf\\'" ,cmd)
              ("\\.docx\\'" ,cmd)
              ("\\.\\(?:djvu\\|eps\\)\\'" ,cmd)
              ("\\.\\(?:jpg\\|jpeg\\|png\\|gif\\|xpm\\)\\'" ,cmd)
              ("\\.\\(?:xcf\\)\\'" ,cmd)
              ("\\.csv\\'" ,cmd)
              ("\\.tex\\'" ,cmd)
              ("\\.\\(?:mp4\\|mkv\\|avi\\|flv\\|rm\\|rmvb\\|ogv\\)\\(?:\\.part\\)?\\'" ,cmd)
              ("\\.\\(?:mp3\\|flac\\)\\'" ,cmd)
              ("\\.html?\\'" ,cmd)
              ("\\.md\\'" ,cmd))))

    (setq dired-omit-files
          (concat dired-omit-files
                  "\\|^.DS_Store$\\|^.projectile$\\|^.git*\\|^.svn$\\|^.vscode$\\|\\.js\\.meta$\\|\\.meta$\\|\\.elc$\\|^.emacs.*"))))

;; `find-dired' alternative using `fd'
(when (executable-find "fd")
  (use-package fd-dired))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26639 9048 148188 0) :init (26639 9048 148182 0) :init-secs (0 0 44 0) :use-package-secs (0 0 112 0)))

* Ibuffer
#+begin_src emacs-lisp
  (use-package ibuffer
    :ensure nil
    :bind ("C-x C-b" . ibuffer)
    :init (setq ibuffer-filter-group-name-face '(:inherit (font-lock-string-face bold))))

   (use-package nerd-icons-ibuffer
     :ensure t
     :hook (ibuffer-mode . nerd-icons-ibuffer-mode)
     :config
     ;; Whether display the icons.
     (setq nerd-icons-ibuffer-icon t)
     (setq nerd-icons-ibuffer-color-icon t)
     (setq nerd-icons-ibuffer-icon-size 1.0)
     (setq  nerd-icons-ibuffer-human-readable-size t)
     ;; A list of ways to display buffer lines with `nerd-icons'.
     ;; See `ibuffer-formats' for details.
     ;; nerd-icons-ibuffer-formats

     ;; Slow Rendering
     ;; If you experience a slow down in performance when rendering multiple icons simultaneously,
     ;; you can try setting the following variable
     (setq inhibit-compacting-font-caches t))

  (use-package ibuffer-project
    :hook (ibuffer . (lambda ()
                       "Group ibuffer's list by project."
                       (setq ibuffer-filter-groups (ibuffer-project-generate-filter-groups))
                       (unless (eq ibuffer-sorting-mode 'project-file-relative)
                         (ibuffer-do-sort-by-project-file-relative))))
    :init (setq ibuffer-project-use-cache t)
    :config
    (defun my-ibuffer-project-group-name (root type)
      "Return group name for project ROOT and TYPE."
      (if (and (stringp type) (> (length type) 0))
          (format "%s %s" type root)
        (format "%s" root)))
    (progn
      (advice-add #'ibuffer-project-group-name :override #'my-ibuffer-project-group-name)
      (setq ibuffer-project-root-functions
            `((ibuffer-project-project-root . ,(nerd-icons-octicon "nf-oct-repo" :height 1.2 :face ibuffer-filter-group-name-face))
              (file-remote-p . ,(nerd-icons-codicon "nf-cod-radio_tower" :height 1.2 :face ibuffer-filter-group-name-face)))))
    (progn
      (advice-remove #'ibuffer-project-group-name #'my-ibuffer-project-group-name)
      (setq ibuffer-project-root-functions
            '((ibuffer-project-project-root . "Project")
              (file-remote-p . "Remote"))))
    (setq ibuffer-formats
          '((mark modified read-only " "
                  (name 18 18 :left :elide)
                  " "
                  (size 9 -1 :right)
                  " "
                  (mode 16 16 :left :elide)
                  " "
                  project-relative-file))))


  ;; (use-package buffer-name-relative-mode
  ;;   :ensure t
  ;;   :vc (:url "https://codeberg.org/ideasman42/emacs-buffer-name-relative" :branch "main")
  ;;   :hook (after-init . buffer-name-relative-mode)
  ;;   :config
  ;;   (setq buffer-name-relative-prefix '("" . "/")))

  ;; (use-package ibuffer-sidebar
  ;;   :load-path "~/.emacs.d/fork/ibuffer-sidebar"
  ;;   :ensure nil
  ;;   :commands (ibuffer-sidebar-toggle-sidebar)
  ;;   :config
  ;;   (setq ibuffer-sidebar-use-custom-font t)
  ;;   (setq ibuffer-sidebar-face `(:family "Helvetica" :height 140)))

  ;; (defun +sidebar-toggle ()q
  ;;   "Toggle both `dired-sidebar' and `ibuffer-sidebar'."
  ;;   (interactive)
  ;;   (dired-sidebar-toggle-sidebar)
  ;;   (ibuffer-sidebar-toggle-sidebar))

#+end_src
* Org-mode
