customizations/tools.org
** Tab-Bar Mode
#+begin_src emacs-lisp
  ;;      (defun my/update-tab-bar-after-theme-change (&rest _args)
  ;;        "Update tab bar face attributes after a theme change."
  ;;        (set-face-attribute 'tab-bar-tab nil
  ;;                            :inherit 'doom-modeline-panel
  ;;                            :foreground 'unspecified
  ;;                            :background 'unspecified)
  ;;        (set-face-attribute 'tab-bar nil
  ;;                            :foreground (face-attribute 'default :foreground)))

  ;;      (advice-add 'load-theme :after #'my/update-tab-bar-after-theme-change)
  ;;      (my/update-tab-bar-after-theme-change)


  ;;     (require 'svg-lib)
  ;;      (require 'svg-tag-mode)
  ;;      (require 'lib-svg-tag-mode)
  ;;      (require 'lib-tab-bar)


  (use-package tabspaces
    :hook (after-init . tabspaces-mode)
    :defer nil
    :init
    (defun +tab-bar-tab-name-function ()
      "Generate a name for the current tab based on the buffer name.
          If the buffer name exceeds `tab-bar-tab-name-truncated-max` characters,
          truncate it and append `tab-bar-tab-name-ellipsis`.  If there are multiple
          windows in the tab, append the count of windows in parentheses.
          Return the formatted tab name."
      (let* ((raw-tab-name (buffer-name (window-buffer (minibuffer-selected-window))))
             (count (length (window-list-1 nil 'nomini)))
             (truncated-tab-name (if (< (length raw-tab-name)
                                        tab-bar-tab-name-truncated-max)
                                     raw-tab-name
                                   (truncate-string-to-width raw-tab-name
                                                             tab-bar-tab-name-truncated-max
                                                             nil nil tab-bar-tab-name-ellipsis))))
        (if (> count 1)
            (concat truncated-tab-name "(" (number-to-string count) ")")
          truncated-tab-name)))

    (defun +tab-bar-tab-name-format-function (tab i)
      "Format the display name for a tab in the tab bar.
          TAB is the tab descriptor, and I is the tab index.  Apply custom
          styling to the tab name and index using `tab-bar-tab-face-function`.

          - Prefix the tab with its index and a colon, styled with a bold weight.
          - Surround the tab name with spaces, adjusting vertical alignment
            for aesthetics.
          - Return the formatted tab name with applied text properties."
      (let ((face (funcall tab-bar-tab-face-function tab)))
        (concat
         ;; change tab-bar's height
         (propertize " " 'display '(raise 0.25))
         (propertize (format "%d:" i) 'face `(:inherit ,face :weight ultra-bold))
         (concat " " (propertize (alist-get 'name tab) 'face `(:inherit ,face :underline t)) " ")
         (propertize " " 'display '(raise -0.25))
         )))
    ;; :config
    ;; (require 'lib-svg-tag-mode)
    ;; (add-hook 'tab-bar-new-tab 'lib-svg-tag-mode)
    :bind (("s-t" . tab-bar-new-tab)
           ("s-w" . tab-bar-close-tab))
    :custom
    (tab-bar-close-button-show nil)
    (tab-bar-new-button-show nil)
    (tab-bar-show t)
    (tab-bar-separator "​​")
    (tab-bar-tab-hints t)
    (tab-bar-new-tab-choice "*scratch*")
    (tab-bar-select-tab-modifiers '(meta))
    (tab-bar-tab-name-truncated-max 15)
    (tab-bar-border nil)
    (tab-bar-auto-width nil)
    (tab-bar-format '(tab-bar-format-tabs
                      tab-bar-format-add-tab
                      tab-bar-format-align-right
                      +tab-bar-telega-icon))
    ;; tab-bar-tab-name-function #'tab-bar-tab-name-truncated
    ;; tab-bar-tab-name-format-function #'eli/tab-bar-tab-name-with-svg
    (tab-bar-tab-name-function #'+tab-bar-tab-name-function)
    (tab-bar-tab-name-format-function #'+tab-bar-tab-name-format-function)
    (tab-bar-auto-width-max '((200)  20))
    ;; Sessions
    (tabspaces-session t)
    (tabspaces-session-auto-restore t)
    )
#+end_src

#+RESULTS:
: tab-bar-close-tab

- style for telega ， from https://github.com/LuciusChen/.emacs.d/blob/646e42fce207117de0e73d7cf16a04e4c21a11e4/lib/lib-tabbar.el
#+begin_src emacs-lisp

  ;; telega notification
  (defvar +tab-bar-telega-indicator-cache nil)

  (defun +tab-bar-telega-icon-update (&rest rest)
    "Update the Telega icon in the tab bar, reflecting notification counts.
  This function takes REST as an optional argument, though it is not used
  within the function body.

  The function checks if the Telega server is live and if the server buffer
  is active.  It computes various counts, including:

  - The number of unread messages (`unread-count`).
  - The number of mentions (`mentioned-count`).
  - The number of unread reactions (`reaction-count`).
  - The number of keyword matches (`keyword-count`).

  The total `notification-count` is the sum of these counts.  If this total
  is greater than zero, a formatted string with icons and counts is returned.
  This string includes:

  - A Telegram icon.
  - A bullet with the unread count.
  - An at-sign with the mention count.
  - A heart with the reaction count.
  - A hash with the keyword count.

  The function uses `nerd-icons-faicon` for the Telegram icon and applies
  specific faces to the counts for visual differentiation."
    (setq +tab-bar-telega-indicator-cache
          (when (and (fboundp 'telega-server-live-p)
                     (telega-server-live-p)
                     (buffer-live-p telega-server--buffer))
            (let* ((me-user (telega-user-me 'locally))
                   (online-p (and me-user (telega-user-online-p me-user)))
                   (keyword-count (length (ring-elements telega--notification-messages-ring)))
                   (unread-count (or (plist-get telega--unread-chat-count :unread_unmuted_count) 0))
                   (mentioned-count (apply '+ (mapcar (telega--tl-prop :unread_mention_count)
                                                      (telega-filter-chats telega--ordered-chats '(mention)))))
                   ;; 最好使用 (and is-known unread-reactions) temex 来切断一般列表中不可见的聊天
                   ;; 此类聊天，例如对频道中的帖子发表评论，或者您进入、写下一些内容然后离开，然后有人做出反应的聊天
                   (reaction-count (apply '+ (mapcar (telega--tl-prop :unread_reaction_count)
                                                     (telega-filter-chats telega--ordered-chats '(and is-known unread-reactions)))))
                   (notification-count (+ mentioned-count unread-count reaction-count keyword-count)))
              (when (> notification-count 0)
                (concat "[" (nerd-icons-faicon "nf-fae-telegram" :face '(:inherit nerd-icons-purple))
                        (when (> unread-count 0)
                          (propertize (concat " ●​​​" (number-to-string unread-count))
                                      'face 'telega-unmuted-count))
                        (when (> mentioned-count 0)
                          (propertize (concat " @​​​" (number-to-string mentioned-count))
                                      'face 'telega-mention-count))
                        (when (> reaction-count 0)
                          (propertize (concat " ♥​​​" (number-to-string reaction-count))
                                      'face 'telega-mention-count))
                        (when (> keyword-count 0)
                          (propertize (concat " #​​​" (number-to-string keyword-count))
                                      'face 'telega-unmuted-count))
                        "] "))))))

  (defun +tab-bar-telega-icon ()
    "Return the Telega icon for the tab bar, updating if necessary.
  This function checks if `+tab-bar-telega-indicator-cache` is set.  If it is,
  the cached value is returned.  Otherwise, it calls `+tab-bar-telega-icon-update`
  to refresh the icon and returns the updated value."
    (or +tab-bar-telega-indicator-cache
        (+tab-bar-telega-icon-update)))
#+end_src
#+RESULTS:
: t

** MiniBuffer
    #+begin_src emacs-lisp
    ;; (use-package nano-minibuffer
    ;; :defer nil
    ;; :vc (:url https://github.com/rougier/nano-minibuffer))
#+end_src

** posframe
#+begin_src emacs-lisp
;; Child frame
  (use-package posframe
    :hook (after-load-theme . posframe-delete-all)
    :init
    (defface posframe-border
      `((t (:inherit region)))
      "Face used by the `posframe' border."
      :group 'posframe)
    (defvar posframe-border-width 2
      "Default posframe border width.")
    :config
    (with-no-warnings
      (defun my-posframe--prettify-frame (&rest _)
        (set-face-background 'fringe nil posframe--frame))
      (advice-add #'posframe--create-posframe :after #'my-posframe--prettify-frame)

      (defun posframe-poshandler-frame-center-near-bottom (info)
        (cons (/ (- (plist-get info :parent-frame-width)
                    (plist-get info :posframe-width))
                 2)
              (/ (+ (plist-get info :parent-frame-height)
                    (* 2 (plist-get info :font-height)))
                 2)))))

(use-package transient-posframe
    :diminish
    :defines posframe-border-width
    :custom-face
    (transient-posframe ((t (:inherit tooltip))))
    (transient-posframe-border ((t (:inherit posframe-border :background unspecified))))
    :hook (after-init . transient-posframe-mode)
    :init
    (setq transient-posframe-border-width posframe-border-width
          transient-posframe-min-width 80
          transient-posframe-min-height nil
          transient-posframe-poshandler 'posframe-poshandler-frame-center
          transient-posframe-parameters '((left-fringe . 8)
                                          (right-fringe . 8)))
    :config
    (with-no-warnings
      ;; FIXME:https://github.com/yanghaoxie/transient-posframe/issues/5#issuecomment-1974871665
      (defun my-transient-posframe--show-buffer (buffer _alist)
        "Show BUFFER in posframe and we do not use _ALIST at this period."
        (when (posframe-workable-p)
          (let* ((posframe
                  (posframe-show buffer
                                 :font transient-posframe-font
                                 :position (point)
                                 :poshandler transient-posframe-poshandler
                                 :background-color (face-attribute 'transient-posframe :background nil t)
                                 :foreground-color (face-attribute 'transient-posframe :foreground nil t)
                                 :initialize #'transient-posframe--initialize
                                 :min-width transient-posframe-min-width
                                 :min-height transient-posframe-min-height
                                 :internal-border-width transient-posframe-border-width
                                 :internal-border-color (face-attribute 'transient-posframe-border :background nil t)
                                 :override-parameters transient-posframe-parameters)))
            (frame-selected-window posframe))))
      (advice-add #'transient-posframe--show-buffer :override #'my-transient-posframe--show-buffer)

      (setq transient-mode-line-format nil) ; without line

      (defun transient-posframe--initialize ()
        "Initialize transient posframe."
        (setq window-resize-pixelwise t)
        (setq window-size-fixed nil))

      (defun transient-posframe--resize (window)
        "Resize transient posframe."
        (fit-frame-to-buffer-1 (window-frame window)
                               nil transient-posframe-min-height
                               nil transient-posframe-min-width))
      (advice-add 'transient--fit-window-to-buffer :override #'transient-posframe--resize)

      (defun my-transient-posframe--hide ()
        "Hide transient posframe."
        (posframe-hide transient--buffer-name))
      (advice-add #'transient-posframe--delete :override #'my-transient-posframe--hide)))

#+end_src


** Highlighting
#+begin_src emacs-lisp
      (use-package hl-todo
        :ensure t
        :defer t
        :config
        (setq hl-todo-keyword-faces
              '(("TODO"   . "#FF0000")
                ("PERF" . "#4EEE85")
                ("FIXME"  . "#FF0000")
                ("DEBUG-ON-QUIT"  . "#A020F0")
                ("GOTCHA" . "#FF4500")
                ("NTC"   . "#1E90FF"))) ;;short for NOTICE
        (global-hl-todo-mode))


      (use-package paren
        :custom-face (show-paren-match ((t (:foreground "SpringGreen3" :underline t :weight bold))))
        :config
        (setq show-paren-when-point-inside-paren t
              show-paren-when-point-in-periphery t
              show-paren-context-when-offscreen 'overlay ;; FIXME not working yet
              blink-matching-paren-highlight-offscreen t
              show-paren-delay 0.2)
        )

      ;; [rainbow-delimiters] Highlight brackets according to their depth
      (use-package rainbow-delimiters
        :ensure t
        :defer t
        :hook ((prog-mode conf-mode yaml-mode) . rainbow-delimiters-mode)
        :config
        (setq rainbow-delimiters-max-face-count 5))

      (use-package highlight-parentheses
        :ensure t
        :defer t
        :hook ((minibuffer-setup . highlight-parentheses-minibuffer-setup)
               (prog-mode . highlight-parentheses-mode))
        :config
        (setq highlight-parentheses-colors '("firebrick1" "firebrick3" "orange1" "orange3")
              highlight-parentheses-attributes '((:underline t) (:underline t) (:underline t))
              highlight-parentheses-delay 0.2)
        )

      (use-package hl-line
        :hook (after-init . global-hl-line-mode)
        :config
        ;; (setq hl-line-sticky-flag nil)
        ;; ;; Highlight starts from EOL, to avoid conflicts with other overlays
        ;; (setq hl-line-range-function (lambda () (cons (line-end-position)
        ;;                                          (line-beginning-position 2))))
      )

    (use-package region-occurrences-highlighter
      :ensure t
      :defer t
      :config
      (add-hook 'prog-mode-hook #'region-occurrences-highlighter-mode)
      (add-hook 'org-mode-hook #'region-occurrences-highlighter-mode)
      (add-hook 'text-mode-hook #'region-occurrences-highlighter-mode)
      (define-key region-occurrences-highlighter-nav-mode-map "\M-n" 'region-occurrences-highlighter-next)
      (define-key region-occurrences-highlighter-nav-mode-map "\M-p" 'region-occurrences-highlighter-prev))


  (use-package colorful-mode
    :ensure t ; Optional
    :defer t
    :hook (prog-mode text-mode)
    ;; :config (global-colorful-mode) ; Enable it globally
    ...)

#+end_src
** Mini Component
#+begin_src emacs-lisp

(defun exec/lsp-mode-string()
  (concat
   (propertize " eglot "
               'face '(:foreground "white" :background "brown"))
   (propertize
    (format (if (derived-mode-p 'eglot-mode)
                " on  "" off "))
    'face '(:foreground "white" :background "gray40"))))

(add-to-list 'header-line-format '(:eval (exec/lsp-mode-string)) t)

(setq-default header-line-format  '("" keycast-header-line (:eval (exec/lsp-mode-string))))

#+end_src
