customizations/tools.el

;;      (defun my/update-tab-bar-after-theme-change (&rest _args)
;;        "Update tab bar face attributes after a theme change."
;;        (set-face-attribute 'tab-bar-tab nil
;;                            :inherit 'doom-modeline-panel
;;                            :foreground 'unspecified
;;                            :background 'unspecified)
;;        (set-face-attribute 'tab-bar nil
;;                            :foreground (face-attribute 'default :foreground)))

;;      (advice-add 'load-theme :after #'my/update-tab-bar-after-theme-change)
;;      (my/update-tab-bar-after-theme-change)


;;     (require 'svg-lib)
;;      (require 'svg-tag-mode)
;;      (require 'lib-svg-tag-mode)
;;      (require 'lib-tab-bar)
