customizations/tools.org
** desktop save/restore/recovery
#+begin_src emacs-lisp
    (use-package auto-save
      :defer nil
      :vc (:url "https://github.com/manateelazycat/auto-save")
      :init
      (setq auto-save-silent nil)   ; quietly save
      ;; (setq auto-save-delete-trailing-whitespace t)  ; automatically delete spaces at the end of the line when saving
      :config
      (auto-save-enable)
    ;;; custom predicates if you don't want auto save.
    ;;; disable auto save mode when current filetype is an gpg file.
      (setq auto-save-disable-predicates
            '((lambda ()
                (string-suffix-p
                 "gpg"
                 (file-name-extension (buffer-name)) t)))))
  ;; (Require 'auto-save)
  ;; (auto-save-enable)
  ;;     (setq auto-save-silent nil)

    ;; ;; Restore Opened Files
    ;; (progn
    ;;   (desktop-save-mode 1)
    ;;   ;; save when quit
    ;;   (setq desktop-save t)

    ;;   ;; no ask if crashed
    ;;   (setq desktop-load-locked-desktop t)
    ;;   (setq desktop-restore-frames t)
    ;;   (setq desktop-auto-save-timeout 300)

    ;;   ;; save some global vars
    ;;   (setq desktop-globals-to-save nil)
    ;;   ;; 2023-09-16 default
    ;;   ;; '(desktop-missing-file-warning tags-file-name tags-table-list search-ring regexp-search-ring register-alist file-name-history)
    ;;   (setq desktop-dirname "~/.emacs.d/var/desktop/")
    ;;   )

    ;; ;; (progn
    ;; ;;   (require
  ;; ' desktop-recover)
    ;;   ;; optionallly:
    ;;     (setq desktop-recover-location
    ;;           (desktop-recover-fixdir "~/.emacs.d/var/desktop/"))
    ;;     ;; Brings up the interactive buffer restore menu
    ;;     (desktop-recover-interactive)
    ;;     ;; Note that after using this menu, your desktop will be saved
    ;;     ;; automatically (triggered by the auto-save mechanism).
    ;;     ;; For finer-grained control of the frequency of desktop saves,
    ;;     ;; you can add the standard keybindings to your set-up:
    ;;     (desktop-recover-define-global-key-bindings "\C-c%")
    ;;   )
#+end_src

#+RESULTS:
: t

** treemacs
#+begin_src emacs-lisp
    ;; A tree layout file explorer
  (use-package treemacs
    :commands (treemacs-follow-mode
               treemacs-filewatch-mode
               treemacs-git-mode)
    :custom-face
    (cfrs-border-color ((t (:inherit posframe-border))))
    :bind (([f8]        . treemacs)
           ("M-0"       . treemacs-select-window)
           ("C-x t 1"   . treemacs-delete-other-windows)
           ("C-x t t"   . treemacs)
           ("C-x t b"   . treemacs-bookmark)
           ("C-x t C-t" . treemacs-find-file)
           ("C-x t M-t" . treemacs-find-tag)
           :map treemacs-mode-map
           ([mouse-1]   . treemacs-single-click-expand-action))
    :config
    (setq treemacs-collapse-dirs           (if treemacs-python-executable 3 0)
          treemacs-missing-project-action  'remove
          treemacs-sorting                 'alphabetic-asc
          treemacs-follow-after-init       t
          treemacs-width                   30
          ;; treemacs-no-png-images           (not centaur-icon)
          )

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (pcase (cons (not (null (executable-find "git")))
                 (not (null (executable-find "python3"))))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))

    (use-package treemacs-nerd-icons
      :demand t
      ;; :when (icons-displayable-p)
      :custom-face
      (treemacs-nerd-icons-root-face ((t (:inherit nerd-icons-green :height 1.3))))
      (treemacs-nerd-icons-file-face ((t (:inherit nerd-icons-dsilver))))
      :config (treemacs-load-theme "nerd-icons"))

    (use-package treemacs-magit
      :hook ((magit-post-commit
              git-commit-post-finish
              magit-post-stage
              magit-post-unstage)
             . treemacs-magit--schedule-update))

    (use-package treemacs-tab-bar
      :demand t
      :config (treemacs-set-scope-type 'Tabs)))

    ;; (treemacs-start-on-boot)
#+end_src

#+RESULTS:
: treemacs-single-click-expand-action

* Gptel-AI copilot
#+begin_src emacs-lisp
  ;; (add-to-list 'load-path "~/.emacs.d/site-lisp/copilot.el-main")
  ;; (require 'copilot)
  ;; (add-hook 'prog-mode-hook 'copilot-mode)
  ;; ;; (define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
  ;; (define-key copilot-completion-map (kbd "M-w") 'copilot-accept-completion-by-word)
  ;; (define-key copilot-completion-map (kbd "M-q") 'copilot-accept-completion-by-line)

  (use-package gptel
    :ensure nil
    :defer nil
    :vc (:url "https://github.com/karthink/gptel" :rev :newest)
    :config
    ;; default backend configuration
    ;; (setq
    ;;  gptel-model "codegeex4:latest"
    ;;  gptel-backend (gptel-make-ollama "Ollama"
    ;;                  :host "localhost:11434"
    ;;                  :stream t
    ;;                  :models '("codegeex4:latest")))

    ;; DeepSeek offers an OpenAI compatible API
    (defun get-openai-api-key ()
      "Return the OpenAI API key from ~/.authinfo."
      (let ((authinfo-file (expand-file-name "~/.authinfo")))
        (with-temp-buffer
          (insert-file-contents authinfo-file)
          (goto-char (point-min))
          (when (re-search-forward "^machine api\\.deepseek\\.com login apikey password \\(\\S-+\\)$" nil t)
            (match-string 1)))))

    (defvar gptel-make-gemini
      (gptel-make-gemini "Gemini"
        :key "AIzaSyCNSfEqa_MS8PQGuJPNVWwfM0ivkuTe7xM"
        :stream t))
    ;; OPTIONAL configuration
    (setq
     gptel-default-mode 'org-mode
     gptel-model 'gemini-2.0-flash
     gptel-backend gptel-make-gemini)


    )

  (use-package gptel-quick
    :defer nil
    :after gptel
    :vc (gptel-quick :url "https://github.com/karthink/gptel-quick" :rev :newest)
    :config
    (setq gptel-quick-backend gptel-make-gemini
          gptel-quick-model 'gemini-2.0-flash)
    ;; ;; (keymap-set embark-general-map "?" #'gptel-quick)
    ;; :hook （after-init . gptel-quick）
    )

  ;; (use-package immersive-translate
  ;;   :ensure t
  ;;   :config
  ;;   (add-hook 'elfeed-show-mode-hook #'immersive-translate-setup)
  ;;   (add-hook 'nov-pre-html-render-hook #'immersive-translate-setup)
  ;;   )
  ;; (setq immersive-translate-backend 'DeepSeek
  ;;       immersive-translate-chatgpt-host "api.deepseek.com")
  (use-package go-translate
    ;; (setq gt-langs '(en fr))
    :custom  
    (gt-preset-translators
     `((ts-1 . ,(gt-translator
                 :taker (gt-taker :langs '(en zh) :text 'buffer)
                 :engines (list (gt-google-engine))
                 :render (gt-overlay-render))))))
#+end_src

#+RESULTS:
: api.deepseek.com

* Blog-Publish
#+begin_src emacs-lisp

  (use-package ox-hugo
    :ensure t
    :defer t
    :after ox
    :custom
    (org-hugo-base-dir "~/codebase/blog-bus/dingtele.github.io/"))

  (defun org-hugo-new-subtree-post-capture-template ()
    "Returns `org-capture' template string for new Hugo post.
            See `org-capture-templates' for more information."
    (let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
           (date (format-time-string (org-time-stamp-format :long :inactive) (org-current-time)))
           (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
           (tags (read-from-minibuffer "tags: "))
           (categories (read-from-minibuffer "categories: "))
           (fname (org-hugo-slug title)))
      (mapconcat #'identity
                 `(
                   ,(concat "* TODO " title "  :" tags ":" categories)
                   ":PROPERTIES:"
                   ,(concat ":EXPORT_FILE_NAME: " fname)
                   ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
                   ":END:"
                   "%?\n")                ;Place the cursor here finally
                 "\n")))




#+end_src

* Reading & notes
** Common
#+begin_src emacs-lisp
  (use-package pos-tag-highlight
    :vc (:url "https://github.com/yibie/pos-tag-highlight" :rev :newest))
#+end_src
** Shrface

#+begin_src emacs-lisp
(with-eval-after-load 'nov
  (define-key nov-mode-map (kbd "<tab>") 'shrface-outline-cycle)
  (define-key nov-mode-map (kbd "S-<tab>") 'shrface-outline-cycle-buffer)
  (define-key nov-mode-map (kbd "C-t") 'shrface-toggle-bullets)
  (define-key nov-mode-map (kbd "C-j") 'shrface-next-headline)
  (define-key nov-mode-map (kbd "C-k") 'shrface-previous-headline)
  (define-key nov-mode-map (kbd "M-l") 'shrface-links-counsel) ; or 'shrface-links-helm or 'shrface-links-consult
  (define-key nov-mode-map (kbd "M-h") 'shrface-headline-consult)) ; or 'shrface-headline-helm or 'shrface-headline-consult
#+end_src
