customizations/tools.org
** Eglot
#+begin_src emacs-lisp
    ;; (use-package eglot
    ;;   :defer t
    ;;   :hook
    ;;   ;; (python-ts-mode . eglot-ensure)
    ;;   ;; (clojure-mode . eglot-ensure)
    ;;   ;; (clojure-ts-mode . eglot-ensure)
    ;;   ;; (clojure-ts-clojurescript-mode .eglot-ensure)
    ;;   (eglot-managed-mode . #'my/eglot-capf)
      
    ;;   :config
    ;;   (add-to-list 'eglot-server-programs '(python-mode . ("pyright")))
    ;;   (add-to-list 'eglot-server-programs '(clojure-mode . ("clojure-lsp")))
    ;;   (add-to-list 'eglot-server-programs '(clojure-ts-mode . ("clojure-lsp")))
    ;;   (add-to-list 'eglot-server-programs '(clojure-ts-clojurescript-mode . ("clojure-lsp")))

    ;;   (defun my/eglot-capf ()
    ;;     "Set custom completion-at-point functions for Eglot."
    ;;     (setq-local completion-at-point-functions '(eglot-completion-at-point)))
    ;;   )

    ;; (use-package eglot
    ;;   :hook (eglot-managed-mode . my-eglot-mode-hook)
    ;;   :config
    ;;   (setq eglot-events-buffer-size 0)
    ;;   (setq eglot-events-buffer-config '(:size 0 :format full))
    ;;   (setq eglot-extend-to-xref t)
    ;;   (setq eglot-autoshutdown t)
    ;;   (setq eglot-prefer-plaintext t)
    ;;   (setq eglot-ignored-server-capabilities '(:documentHighlightProvider
    ;;                                             :documentOnTypeFormattingProvider))
    ;;   (setq jsonrpc-default-request-timeout 15)
    ;;   (define-key eglot-mode-map (kbd "C-c r") 'eglot-rename-with-current)
    ;;   (define-key eglot-mode-map (kbd "C-c o") 'eglot-code-action-override)
    ;;   (define-key eglot-mode-map (kbd "C-c i") 'eglot-code-action-organize-imports)
    ;;   (define-key eglot-mode-map (kbd "C-c h") 'eldoc-box-help-at-point)
    ;;   (define-key eglot-mode-map (kbd "C-c w r") 'eglot-restart-workspace)
    ;;   (define-key eglot-mode-map (kbd "C-c v") 'eglot-find-implementation)
    ;;   (define-key eglot-mode-map (kbd "C-c f") 'eglot-code-actions-current-line)
    ;;   (define-key eglot-mode-map (kbd "C-c a") 'eglot-code-actions))

#+end_src
** Eglot-Java
#+begin_src emacs-lisp
  ;; (require 'eglot)

  ;;   (require 'eglot-java)
  ;;   (add-hook 'java-mode-hook #'eglot-java-mode)
  ;;   (setq eglot-java-server-install-dir "~/codebase/src/java/eclipse.jdt.ls")
  ;;   (setq eglot-java-eclipse-jdt-cache-directory "~/tmp/eglot-eclipse-jdt-cache")
#+end_src

** Database
#+begin_src emacs-lisp

  ;; (require 'ejc-sql)
  ;; (setq clomacs-httpd-default-port 8090) ; Use a port other than 8080.
  ;; ;; Require completion frontend (autocomplete or company). One of them or both.
  ;; (require 'ejc-autocomplete)
  ;; (add-hook 'ejc-sql-minor-mode-hook
  ;;           (lambda ()
  ;;             (auto-complete-mode t)
  ;;             (ejc-ac-setup)))

  ;; (setq ejc-use-flx t)
  ;; (setq ejc-flx-threshold 2)
  ;; (require 'ejc-company)
  ;; (push 'ejc-company-backend company-backends)
  ;; (add-hook 'ejc-sql-minor-mode-hook
  ;;           (lambda ()
  ;;             (company-mode t)))
  ;; (setq ejc-complete-on-dot t)
  ;; ;; (company-quickhelp-mode t)
  ;; (setq ejc-completion-system 'standard)

  ;; (add-hook 'ejc-sql-minor-mode-hook
  ;;           (lambda ()
  ;;             (ejc-eldoc-setup)))
  ;; ;; Performance & output customization
  ;; (add-hook 'ejc-sql-connected-hook
  ;;           (lambda ()
  ;;             (ejc-set-fetch-size 50)
  ;;             (ejc-set-max-rows 50)
  ;;             (ejc-set-show-too-many-rows-message t)
  ;;             (ejc-set-column-width-limit 25)
  ;;             (ejc-set-use-unicode t)))
  ;; (setq ejc-result-table-impl 'ejc-result-mode)
  ;; ;; PostgreSQL example
  ;; (ejc-create-connection
  ;;  "PostgreSQL-db-connection"
  ;;  :classpath (concat "~/.m2/repository/org.postgresql/postgresql/42.6.0/"
  ;;                     "postgresql-42.6.0.jar")
  ;;  :subprotocol "postgresql"
  ;;  :subname "//localhost:5432/postgres"
  ;;  :user "postgres"
  ;;  :password "postgres")

#+end_src

** Tree-sitter: querying and highlighting
#+begin_src emacs-lisp
  (require 'treesit)

    (setq treesit-extra-load-path '("~/codebase/src/tree-sitter-module/dist/"))
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)

 ;; Automatic Tree-sitter grammar management
  (use-package treesit-auto
    :hook (after-init . global-treesit-auto-mode)
    :init (setq treesit-auto-install 'prompt))

  ;; Code folding indicators using Tree-sitter
  (use-package treesit-fold-indicators
    :ensure treesit-fold
    :hook (after-init . global-treesit-fold-indicators-mode)
    :init (setq treesit-fold-indicators-priority -1))
#+end_src
** origami
https://github.com/gregsexton/origami.el
#+begin_src emacs-lisp
  (use-package s
    :vc (:url "https://github.com/magnars/s.el" :branch master))
  (require 'dash)
  (use-package origami :ensure t :defer t)
    (with-eval-after-load 'origami
      (define-key origami-mode-map (kbd "C-c f") 'origami-recursively-toggle-node)
      (define-key origami-mode-map (kbd "C-c F") 'origami-toggle-all-nodes))
#+end_src
** hideshow-org
#+begin_src emacs-lisp
  ;; (use-package hideshow-org
  ;;   :vc (:url "https://github.com/shanecelis/hideshow-org"))
  ;; (global-set-key (kbd"C-c h") 'hs-org/minor-mode)
#+end_src

#+RESULTS:

** lsp-bridge
#+begin_src emacs-lisp
  ;; (use-package lsp-brigde
  ;;   :vc (:url "https://github.com/manateelazycat/lsp-bridge")
  ;;   :config
  ;;   (global-lsp-bridge-mode))

  ;; (require 'yasnippet)
  ;; (yas-global-mode 1)

#+end_src

* Emacs Dev Tools
** esup
#+begin_src emacs-lisp
(use-package esup
  :ensure t
:defer t
  :commands esup)

#+end_src
** bug-hunter
#+begin_src emacs-lisp


#+end_src
** Rigrep
#+begin_src emacs-lisp
(use-package rg :defer t)
#+end_src
** Magit
** Eshell
#+begin_src emacs-lisp
  ;; eshell
  (use-package xterm-color
    :commands (xterm-color-filter))
  (use-package eshell
:defer t
    :after xterm-color
    :config
    (setq eshell-scroll-to-bottom-on-input t)
    (define-key eshell-mode-map (kbd "<tab>") #'company-complete)
    (define-key eshell-hist-mode-map (kbd "M-r") #'consult-history)
    (add-hook 'eshell-mode-hook
              (lambda ()
                (setenv "TERM" "xterm-256color")))
    (add-hook 'eshell-before-prompt-hook (setq xterm-color-preserve-properties t))
    (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
    (setq eshell-output-filter-functions
          (remove 'eshell-handle-ansi-color eshell-output-filter-functions)))


  ;; (use-package eshell
  ;;    :config
  ;;    (setq eshell-scroll-to-bottom-on-input t)
  ;;    (setq-local tab-always-indent 'complete)
  ;;    (setq eshell-history-size 10000)
  ;;    (setq eshell-save-history-on-exit t) ;; Enable history saving on exit
  ;;    (setq eshell-hist-ignoredups t) ;; Ignore duplicatesq
  ;;    :hook
  ;;    (eshell-mode . my/eshell-hook))

  (use-package capf-autosuggest
     :hook
     (eshell-mode . capf-autosuggest-mode))

  (defun my/shell-create (name)
     "Create a custom-named eshell buffer with NAME."
     (interactive "sName: ")
     (eshell 'new)
     (let ((new-buffer-name (concat "*eshell-" name "*")))
       (rename-buffer new-buffer-name t)))

  (global-set-key (kbd "C-c s") #'my/shell-create)

#+end_src
* Coding language
** Common
[[https://github.com/Malabarba/aggressive-indent-mode][- aggressive-indent-mode]]
- [[https://ebzzry.com/en/emacs-pairs/#configuration][smart-paren-mode]]

#+begin_src emacs-lisp
      (global-set-key "\C-h\C-f" 'find-function-at-point)

    ;; Minor mode to aggressively keep your code always indented
    (use-package aggressive-indent
      :diminish
      :hook ((after-init . global-aggressive-indent-mode)
             ;; NOTE: Disable in large files due to the performance issues
             ;; https://github.com/Malabarba/aggressive-indent-mode/issues/73
             ;; (find-file . (lambda ()
             ;;                (when (too-long-file-p)
             ;;                  (aggressive-indent-mode -1))))
             )
      :config
      ;; Disable in some modes
      (dolist (mode '(gitconfig-mode
                      asm-mode web-mode html-mode
                      css-mode css-ts-mode
                      go-mode go-ts-mode
                      python-ts-mode yaml-ts-mode
                      scala-mode
                      shell-mode term-mode vterm-mode
                      prolog-inferior-mode))
        (add-to-list 'aggressive-indent-excluded-modes mode))

      ;; Disable in some commands
        (add-to-list 'aggressive-indent-protected-commands #'delete-trailing-whitespace t)

      ;; Be slightly less aggressive in C/C++/C#/Java/Go/Swift
      (add-to-list 'aggressive-indent-dont-indent-if
                   '(and (derived-mode-p 'c-mode 'c++-mode 'csharp-mode
                                         'java-mode 'go-mode 'swift-mode)
                         (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                             (thing-at-point 'line)))))
  )


      ;; [indent-bars] Show indent guides
      (use-package indent-bars
        :ensure t
        :hook (prog-mode . indent-bars-mode)
        :config
        (setq indent-bars-display-on-blank-lines nil
              indent-bars-width-frac 0.2
              indent-bars-color '(highlight :face-bg t :blend 0.2)
              indent-bars-zigzag nil
              indent-bars-highlight-current-depth nil
              indent-bars-pattern "."
              indent-bars-prefer-character t)
        )

      ;; usage for cursor movement see [https://ebzzry.com/en/emacs-pairs/#configuration]
      ;; (use-package smartparens-config
      ;;   :ensure smartparens
      ;;   :hook ((prog-mode org-mode) . turn-on-smartparens-strict-mode)
      ;;   :config (progn (show-smartparens-global-mode t)))

    ;; Automatic parenthesis pairing
    (use-package elec-pair
      :ensure nil
      :hook (after-init . electric-pair-mode)
      :init (setq electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))

#+end_src

#+RESULTS:
| nano-modeline-org-mode | turn-on-smartparens-strict-mode | region-occurrences-highlighter-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-zettel-ref-highlight-setup | #[nil ((add-hook 'after-save-hook 'zz/org-babel-tangle-current-buffer-async 'run-at-end 'only-in-org-mode)) nil] | #[nil ((add-hook 'after-save-hook 'org-babel-tangle :append :local)) nil] | my-nov-font-setup | variable-pitch-mode | toc-org-mode | my/org-prettify-symbols | visual-line-mode | org-tempo-setup | org-block-capf-add-to-completion-at-point-functions | org-appear-mode | #[nil ((display-line-numbers-mode 0)) nil] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

