customizations/tools.el


;; (use-package eglot
;;   :defer t
;;   :hook
;;   ;; (python-ts-mode . eglot-ensure)
;;   ;; (clojure-mode . eglot-ensure)
;;   ;; (clojure-ts-mode . eglot-ensure)
;;   ;; (clojure-ts-clojurescript-mode .eglot-ensure)
;;   (eglot-managed-mode . #'my/eglot-capf)

;;   :config
;;   (add-to-list 'eglot-server-programs '(python-mode . ("pyright")))
;;   (add-to-list 'eglot-server-programs '(clojure-mode . ("clojure-lsp")))
;;   (add-to-list 'eglot-server-programs '(clojure-ts-mode . ("clojure-lsp")))
;;   (add-to-list 'eglot-server-programs '(clojure-ts-clojurescript-mode . ("clojure-lsp")))

;;   (defun my/eglot-capf ()
;;     "Set custom completion-at-point functions for Eglot."
;;     (setq-local completion-at-point-functions '(eglot-completion-at-point)))
;;   )

;; (use-package eglot
;;   :hook (eglot-managed-mode . my-eglot-mode-hook)
;;   :config
;;   (setq eglot-events-buffer-size 0)
;;   (setq eglot-events-buffer-config '(:size 0 :format full))
;;   (setq eglot-extend-to-xref t)
;;   (setq eglot-autoshutdown t)
;;   (setq eglot-prefer-plaintext t)
;;   (setq eglot-ignored-server-capabilities '(:documentHighlightProvider
;;                                             :documentOnTypeFormattingProvider))
;;   (setq jsonrpc-default-request-timeout 15)
;;   (define-key eglot-mode-map (kbd "C-c r") 'eglot-rename-with-current)
;;   (define-key eglot-mode-map (kbd "C-c o") 'eglot-code-action-override)
;;   (define-key eglot-mode-map (kbd "C-c i") 'eglot-code-action-organize-imports)
;;   (define-key eglot-mode-map (kbd "C-c h") 'eldoc-box-help-at-point)
;;   (define-key eglot-mode-map (kbd "C-c w r") 'eglot-restart-workspace)
;;   (define-key eglot-mode-map (kbd "C-c v") 'eglot-find-implementation)
;;   (define-key eglot-mode-map (kbd "C-c f") 'eglot-code-actions-current-line)
;;   (define-key eglot-mode-map (kbd "C-c a") 'eglot-code-actions))

;; (require 'eglot)

;;   (require 'eglot-java)
;;   (add-hook 'java-mode-hook #'eglot-java-mode)
;;   (setq eglot-java-server-install-dir "~/codebase/src/java/eclipse.jdt.ls")
;;   (setq eglot-java-eclipse-jdt-cache-directory "~/tmp/eglot-eclipse-jdt-cache")

;; (require 'ejc-sql)
;; (setq clomacs-httpd-default-port 8090) ; Use a port other than 8080.
;; ;; Require completion frontend (autocomplete or company). One of them or both.
;; (require 'ejc-autocomplete)
;; (add-hook 'ejc-sql-minor-mode-hook
;;           (lambda ()
;;             (auto-complete-mode t)
;;             (ejc-ac-setup)))

;; (setq ejc-use-flx t)
;; (setq ejc-flx-threshold 2)
;; (require 'ejc-company)
;; (push 'ejc-company-backend company-backends)
;; (add-hook 'ejc-sql-minor-mode-hook
;;           (lambda ()
;;             (company-mode t)))
;; (setq ejc-complete-on-dot t)
;; ;; (company-quickhelp-mode t)
;; (setq ejc-completion-system 'standard)

;; (add-hook 'ejc-sql-minor-mode-hook
;;           (lambda ()
;;             (ejc-eldoc-setup)))
;; ;; Performance & output customization
;; (add-hook 'ejc-sql-connected-hook
;;           (lambda ()
;;             (ejc-set-fetch-size 50)
;;             (ejc-set-max-rows 50)
;;             (ejc-set-show-too-many-rows-message t)
;;             (ejc-set-column-width-limit 25)
;;             (ejc-set-use-unicode t)))
;; (setq ejc-result-table-impl 'ejc-result-mode)
;; ;; PostgreSQL example
;; (ejc-create-connection
;;  "PostgreSQL-db-connection"
;;  :classpath (concat "~/.m2/repository/org.postgresql/postgresql/42.6.0/"
;;                     "postgresql-42.6.0.jar")
;;  :subprotocol "postgresql"
;;  :subname "//localhost:5432/postgres"
;;  :user "postgres"
;;  :password "postgres")

(require 'dash)
(use-package origami :ensure t :defer t)
  (with-eval-after-load 'origami
    (define-key origami-mode-map (kbd "C-c f") 'origami-recursively-toggle-node)
    (define-key origami-mode-map (kbd "C-c F") 'origami-toggle-all-nodes))

;; (use-package hideshow-org
;;   :vc (:url "https://github.com/shanecelis/hideshow-org"))
;; (global-set-key (kbd"C-c h") 'hs-org/minor-mode)

;; (use-package lsp-brigde
;;   :vc (:url "https://github.com/manateelazycat/lsp-bridge")
;;   :config
;;   (global-lsp-bridge-mode))

;; (require 'yasnippet)
;; (yas-global-mode 1)

(use-package esup
  :ensure t
:defer t
  :commands esup)



(use-package rg :defer t)
