customizations/tools.el



;; ;; Enable desired features for all lisp modes
;; (require 'clojure-ts-mode)
;; (setq clojure-ts-grammar-recipes nil)

;; (require 'clojure-mode)
;; (setq clojure-indent-style 'always-indent
;;       clojure-indent-keyword-style 'always-indent
;;       clojure-enable-indent-specs nil)

;; (push '(clojure-mode . clojure-ts-mode) major-mode-remap-alist)
;; (push '(clojurescript-mode . clojure-ts-clojurescript-mode) major-mode-remap-alist)

;; (require 'cljsbuild-mode)
;; (require 'elein)

;; (add-hook 'after-save-hook #'check-parens nil t)

;; (require 'cider)
;; (setq nrepl-popup-stacktraces nil)
;; (add-hook 'clojure-ts-mode-hook #'cider-mode)

;; (with-eval-after-load 'cider
;;   (add-hook 'cider-repl-mode-hook 'subword-mode))

;; (require 'flycheck-clojure)
;; (with-eval-after-load 'clojure-ts-mode
;;     (with-eval-after-load 'cider
;;       (with-eval-after-load 'flycheck
;;         (flycheck-clojure-setup))))

;; (unless (package-installed-p 'inf-clojure)
;;   (package-refresh-contents)
;;   (package-install 'inf-clojure))
;; (add-hook 'clojure-mode-hook #'inf-clojure-minor-mode)

;; Emacs lisp mode
